# SetCurrentObject

## Description
Procedure SetCurrentObject sets the referenced object to be the current object of the document. The current object is defined as the last object created, and can be referenced by LNewObj.

```pascal
PROCEDURE SetCurrentObject(h : HANDLE);
```

```python
def vs.SetCurrentObject(h):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Version
Availability: from MiniCAD4.0

## Category
* Utility